# Yen Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Yen Property
SymbolTypeId Class See Also
---
Symbol ¥, indicating unit Currency.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Yen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Yen As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Yen {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace